# HasBeenLocked Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View3D..::..HasBeenLocked Method
View3D Class See Also
---
Identifies if the view has ever been locked.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool HasBeenLocked()
```

Visual Basic
---
```text
Public Function HasBeenLocked As Boolean
```

Visual C++
---
```text
public:
bool HasBeenLocked()
```

# See Also
View3D Class
Autodesk.Revit.DB Namespace